function plus(arr) {
  let result = 0;
  for(var i = 0; i < arr.length; i++) {
    result += arr[i];
  }
  return result
}
/* 7月账单 */
// 6.7至今已还账单 
let month7reduce = [0.34, 53.21, 7.92, 20]
// 6.7至今已入账单
let month7plus = [3.5, 1, 47, 3.9, 133, 6,/*  */ 7580, 15190, 2, 4.82, 40.9, 1, 3.58, 3.78, 3.9, 1, 3.86, 3.8, 7.99, 3.77, 10, 3.75, 7.1, 1, 49.9, 3.9, 20, 3.81, 1, 3.85, 7.5, 3.85, 9.6, 4.84, 22.39, 1.5, 4.8, 1, 2, 20, 2, 1, 3.71, 12, 9, 3.86, 3.77, 14, 3.88, 23.28, 3.8, 1.8, 232.32, 455, 3.84, 10.7, 12, 7.73, 3.79, 1, 3.9, 3.9, 7.8, 1, 3.8, 15.5, 3.8, 4.83, 50, 62, 10, 39, 4.74, 13.8, 13.8, 25, 2.86, 31, 1.5, 3.78, 22, 3.75, 0.9, 10.49, 1, 3.76, 39, 3.8, 19]
console.log(plus(month7plus) - plus(month7reduce))
let 账单 = {
  吃: {},
  穿: [],
  住: [],
  行: {},
  玩: [],
  其他: []
}

账单.吃.伙食 = [3.5, 2, 7.99, 7.1, 20, 7.5, 9.6, 9, 14, 23.28, 3.8, 1.8, 10.7, 12, 7.73, 7.8, 1, 15.5, 13.8, 13.8, 25, 22, 0.9, 10.49, 39, 19]
账单.吃.外食 = [47/* 鸭脖 */]
账单.吃.水果 = [40.9, ]

账单.穿 = [232.32-53.21-7.92, 455]

账单.住 = [7580, 15190]

账单.行.地铁 = [3.9, 4.82, 3.58, 3.78, 3.9, 3.86, 3.8, 3.77, 3.75, 3.9, 3.81, 3.85, 3.85, 4.84, 4.8, 2, 3.71, 3.86, 3.77, 3.88, 3.84, 3.79, 3.9, 3.9, 3.8, 3.8, 4.83, 4.74, 2.86, 3.78, 3.75, 3.76, 3.8, ]
账单.行.打车 = [22.39, 31,]
账单.行.单车 = [1, 1, 1, 1, 1, 1.5, 1, 20, 2, 1, 12, 1, 1.5, 1]

账单.玩 = [50, 62, 10, 39, -20]

账单.话费 = [49.9/* 扬 */]
账单.其他 = [6/* 打印 */, 133/* 水蜜桃 */, 10/* 前端学习 */, ]

Object.keys(账单).forEach(element => {
  if(账单[element].constructor === Array) {
    console.log("%s: %s", element, plus(账单[element]))
  }else if(账单[element].constructor === Object) {
    let res = 0
    Object.keys(账单[element]).forEach(e =>{
      // console.log(e, 账单[element][e])
      res += plus(账单[element][e])
    })
    console.log("%s: %s", element, res)
  }
  
  // element
});

/* 6月账单 */
// 5.7~6.6账单 6678.62
// [27.87, 105.8, 22.08, 12.5, 1.5, 18.1, 17.72, 19, 16]
let month6reduce = [178,188, 198, 368, 288, 189]
let month6plus = [39.38, 39, 100, 2, 11.5, 1.5, 11, 16, 11.8, 34, 9, 10, 10.5, 6, 204.39, 8.3, 24.4]// 18, 17, 3.88, 19, 3.8, 39, 3.76, 1 
// let reduceArr2 = [2458.92,2810.7] //  


/* 5月账单 */
// 4.7~5.6账单 2341.08


/* 4月账单 */
// 3.7~3.6账单 12000


// let reduceRes2 = plus(reduceArr2)
// let plusRes2 = plus(plusArr2)
// let plusRes3 = plus(plusArr3)
// console.log(plusRes2)
// console.log(plusRes1)
// console.log(plusRes1-reduceRes1)
// console.log(plusRes1+plusRes2+plusRes3-reduceRes1)

//  